{
  "Version": "1.3",
  "ID": "f1iwxatiydiqmplpz6o2yxgnoqxwwuthvw4toeqra",
  "Issue Number": "132",
  "Client": {
    "Name": "End-Use Load Profiles for the U.S. Building Stock",
    "Region": "United States",
    "Industry": "Life Science / Healthcare",
    "Website": "https://registry.opendata.aws/nrel-pds-building-stock/",
    "Social Media": "https://registry.opendata.aws/nrel-pds-building-stock/",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "The U.S. Department of Energy (DOE) funded a three-year project, End-Use Load Profiles for the U.S. Building Stock, that culminated in this publicly available dataset of calibrated and validated 15-minute resolution load profiles for all major residential and commercial building types and end uses, across all climate regions in the United States. These EULPs were created by calibrating the ResStock and ComStock physics-based building stock models using many different measured datasets, as described here. This dataset includes load profiles for both the baseline building stock and the building stock with various energy efficiency, electrification, and demand flexibility upgrades applied.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "https://docs.nrel.gov/docs/fy22osti/80889.pdf\n\nThe United States is embarking on an ambitious transition to a 100% clean energy economy by 2050, which will require improving the flexibility of electric grids. One way to achieve grid flexibility is to shed or shift demand to align with changing grid needs. To facilitate this, it is critical to understand how and when energy is used. Highquality end-use load profiles (EULPs) provide this information, and can help cities, states, and utilities understand the time-sensitive value of energy efficiency, demand response, and distributed energy resources.\nPublicly available EULPs have traditionally had limited application because of age and incomplete geographic representation (Frick, Eckman, and Goldman 2017; Frick 2019). To help fill this gap, the U.S. Department of Energy funded a three-year project—End-Use Load Profiles for the U.S. Building Stock—that culminated in the release of a publicly available dataset1 of simulated EULPs representing residential and commercial buildings across the contiguous United States.  ",
    "Where was the data currently stored in this dataset sourced from": "AWS Cloud",
    "How do you plan to prepare the dataset": "We developed our own platform using tools developed by Venus. In terms of data retrieval, the feature is to use scripts to traverse and execute. In terms of data download, we download the data according to the AWS command line. After downloading, we use the open source go-graphsplit of the fileddrive-team to cut it into small files of a specified size. The csv file will store the piece_cid and size information corresponding to the source file.\n",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "Resources on AWS\nDescription\nEnd-Use Load Profiles for the U.S. Building Stock\nResource type\nS3 Bucket\nAmazon Resource Name (ARN)\narn:aws:s3:::oedi-data-lake/nrel-pds-building-stock/\nAWS Region\nus-west-2\nAWS CLI Access (No AWS account required)\naws s3 ls --no-sign-request s3://oedi-data-lake/nrel-pds-building-stock/",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America,Europe",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03620433 United States\nf03620434 United States\nf03620442 Japan\nf03620441 Japan\nf03620447 Singapore\nf03620446 Singapore\nf03601993  South Korea\nf03601967 South Korea\nf03340635 Jakarta\nf03528948 HK\n\nWe plan to find 10 SPs",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "6.5PiB",
    "Single Size Dataset": "650TiB",
    "Replicas": 10,
    "Weekly Allocation": "1PiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-07-18 06:25:04.739053948 UTC",
    "Validated By": "TOPPOOL-LEE",
    "Active": true,
    "Updated At": "2025-07-18 06:25:04.739048369 UTC",
    "Active Request ID": "f4af81dc-2c73-4913-92a4-3ed57a9f89d2",
    "On Chain Address": "f1iwxatiydiqmplpz6o2yxgnoqxwwuthvw4toeqra",
    "Multisig Address": "false",
    "edited": true
  },
  "Allocation Requests": [
    {
      "ID": "d11558c4-0806-45c1-8181-5811a1d6a0d9",
      "Request Type": "First",
      "Created At": "2025-07-16 02:41:02.768085532 UTC",
      "Updated At": "2025-07-16 02:41:02.768086283 UTC",
      "Active": false,
      "Allocation Amount": "281474976710656 B",
      "Signers": [
        {
          "Github Username": "TOPPOOL-LEE",
          "Signing Address": "f1grjkkw3p5hw3vx5gonvppkkzpcgmu4xnwfm7sli",
          "Created At": "2025-07-16 02:43:35.862000000 UTC",
          "Message CID": "bafy2bzacedlzd2eceqa4tosg3rgwuunybwmvw2wgop2rl7zesgwbhtjs2dmnu"
        }
      ]
    },
    {
      "ID": "f4af81dc-2c73-4913-92a4-3ed57a9f89d2",
      "Request Type": "Refill",
      "Created At": "2025-07-18 06:21:29.300231337 UTC",
      "Updated At": "2025-07-18 06:21:29.300232277 UTC",
      "Active": false,
      "Allocation Amount": "562949953421312B",
      "Signers": [
        {
          "Github Username": "TOPPOOL-LEE",
          "Signing Address": "f1grjkkw3p5hw3vx5gonvppkkzpcgmu4xnwfm7sli",
          "Created At": "2025-07-18 06:25:01.347000000 UTC",
          "Message CID": "bafy2bzacea7htbgso4iofasjmxqhr22ri5rtqpupczs56pag4zi4dlz7phsqo"
        }
      ]
    }
  ]
}