{
  "Version": "1.3",
  "ID": "f1y2mpni26wiicjt3yvw7xi3z7j2ri4gi2xvwtrpi",
  "Issue Number": "42",
  "Client": {
    "Name": "Broad Institute",
    "Region": "United Kingdom",
    "Industry": "Life Science / Healthcare",
    "Website": "https://registry.opendata.aws/cellpainting-gallery/",
    "Social Media": "https://registry.opendata.aws/cellpainting-gallery/",
    "Social Media Type": "Slack",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "FrogHub has always defined itself as a tool developer and infrastructure builder in the Filecoin ecosystem. In 2019, we started to focus on technical solutions and development based on the IPFS protocol and Filecoin network. We have been working hard to become a qualified builder in the filecoin ecosystem.\r\n\r\nOur team is a very pure development team, more than 90% of which are developers, more than half of whom have more than 5 years of development experience in communication, Internet, blockchain and other industries. We hope that we can gain users' recognition by exporting useful tools and platforms.\r\n\r\nIn order to contribute to the filecoin community, we have developed the open source sector repair tool Filecoin-Sealer-Recover and the nft free authoring platform NFT-Creator.\r\nIn addition, we plan to provide a sector browser for the community in 2023 and build the liquidity pledge platform STFIL on FVM.\r\n\r\nSee the links below for details.\r\n- making: https://github.com/orgs/froghub-io",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Disclaimer: \r\nDue to un-answered issues around whether combined requests or duplicate requests can be used to apply LDN. This is a series of recent new open datasets never applied by anybody (aka calling dibs).\r\n\r\nDescription: \r\nThe Cell Painting Gallery is a collection of image datasets created using the Cell Painting assay. The images of cells are captured by microscopy imaging, and reveal the response of various labeled cell components to whatever treatments are tested, which can include genetic perturbations, chemicals or drugs, or different cell types. \r\n\r\ns3://cellpainting-gallery",
    "Where was the data currently stored in this dataset sourced from": "AWS Cloud",
    "How do you plan to prepare the dataset": "After we download data from the Internet, the data is cut into disks through Singularity, and then the hard disk is mailed to the SPs.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://registry.opendata.aws/cellpainting-gallery/",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "1.5 to 2 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, Europe",
    "How will you be distributing your data to storage providers": "Cloud storage (i.e. S3), HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f02984331 --Australia \r\nf02883857 -- Singapore \r\nf02852273 -- United Kingdom \r\nf02973061 -- Russia\r\nf02889193---Vietnam",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "4PiB",
    "Single Size Dataset": "1PiB",
    "Replicas": 4,
    "Weekly Allocation": "1PiB"
  },
  "Lifecycle": {
    "State": "ReadyToSign",
    "Validated At": "2024-11-01 04:50:29.834926439 UTC",
    "Validated By": "TOPPOOL-LEE",
    "Active": true,
    "Updated At": "2024-11-01 04:50:29.834931302 UTC",
    "Active Request ID": "d0dfaf71-12b6-47e1-9831-e056daf32760",
    "On Chain Address": "f1y2mpni26wiicjt3yvw7xi3z7j2ri4gi2xvwtrpi",
    "Multisig Address": "false",
    "edited": true
  },
  "Allocation Requests": [
    {
      "ID": "d0dfaf71-12b6-47e1-9831-e056daf32760",
      "Request Type": "First",
      "Created At": "2024-11-01 04:50:29.834933282 UTC",
      "Updated At": "2024-11-01 04:50:29.834934482 UTC",
      "Active": true,
      "Allocation Amount": "256TiB",
      "Signers": []
    }
  ]
}